/******************************************************************************

Практическое задание 1
Писарькова Богдана 22ИС-21

*******************************************************************************/
using System;
using static System.Math;

class Program
{
    static void Main(string[] args)
    {
        var result = (
            ((6 - 4.5/1) / 0.03 / Sqrt(3.5/1 - 2.65) * 4 + 2/5) - 
            Pow(0.3 - 3/20d, 1.5) / (1.88 + 2.12) * 1/80) * (1/5d) * 
            Pow(1d/3d, 1d/3d);
        Console.WriteLine(result);
    }   
}