/******************************************************************************
Упорядочить одномерный массив в порядке возрастания синусов элементов.
*******************************************************************************/
using System;

class Program
{
    static void Main()
    {
        // исходный массив
        double[] array = { 0.7, 1.2, 0.5, -0.9, -1.4, 0.3 };

        // сортировка по возрастанию синусов элементов
        Array.Sort(array, (x, y) => Math.Sin(x).CompareTo(Math.Sin(y)));

        // вывод отсортированного массива
        Console.WriteLine("Отсортированный массив:");

        for (int i = 0; i < array.Length; i++)
        {
            Console.WriteLine(array[i]);
        }

        Console.ReadKey();
    }
}